Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: **Only include approved translations**: Only translations that have been approved by a reviewer will be committed. This option requires :ref:`project-translation_review` to be enabled.
sv: **Inkludera endast godkÃ¤nda Ã¶versÃ¤ttningar**: Endast Ã¶versÃ¤ttningar som har godkÃ¤nts av en granskare kommer att lÃ¤ggas in. Detta alternativ krÃ¤ver att :ref:`project-translation_review` Ã¤r aktiverat.

source: Whether unauthenticated :ref:`hooks` are to be used for this repository.
sv: Om oautentiserade :ref:`hooks` ska anvÃ¤ndas fÃ¶r detta arkiv.

source: Define language codes mapping when importing translations into Weblate. Use this when language codes are inconsistent in your repositories and you want to get a consistent view in Weblate or in case you want to use non-standard naming of your translation files.
sv: Definiera sprÃ¥kkodsmappning nÃ¤r du importerar Ã¶versÃ¤ttningar till Weblate. AnvÃ¤nd detta nÃ¤r sprÃ¥kkoderna Ã¤r inkonsekventa i dina arkiv och du vill fÃ¥ en konsekvent vy i Weblate eller om du vill anvÃ¤nda icke-standardiserade namn pÃ¥ dina Ã¶versÃ¤ttningsfiler.

source: The typical use case might be mapping American English to English: ``en_US:en``
sv: Ett typiskt anvÃ¤ndningsfall kan vara att mappa amerikansk engelska till engelska: ``en_US:en``

source: Multiple mappings to be separated by comma: ``en_GB:en,en_US:en``
sv: Flera mappningar ska separeras med kommatecken: ``en_GB:en,en_US:en``

source: Using non standard code: ``ia_FOO:ia``
sv: AnvÃ¤nda icke-standardkod: ``ia_FOO:ia``

source: The language codes are mapped when matching the translation files and the matches are case sensitive, so ensure you use the source language codes in same form as used in the filenames.
sv: SprÃ¥kkoderna mappas nÃ¤r Ã¶versÃ¤ttningsfilerna matchas och matchningarna Ã¤r skiftlÃ¤geskÃ¤nsliga, sÃ¥ se till att du anvÃ¤nder kÃ¤llsprÃ¥kkoderna i samma form som i filnamnen.

source: Optionally, it can be also used as a source for the machine translation.
sv: Alternativt kan den ocksÃ¥ anvÃ¤ndas som kÃ¤lla fÃ¶r maskinÃ¶versÃ¤ttning.

source: Customization of quality checks and other Weblate behavior, see :ref:`custom-checks`.
sv: Anpassning av kvalitetskontroller och annat Weblate-beteende, se :ref:`custom-checks`.

source: Component configuration
sv: Komponentkonfiguration

source: A component is a grouping of something for translation. You enter a VCS repository location and file mask for which files you want translated, and Weblate automatically fetches from this VCS, and finds all matching translatable files.
sv: En komponent Ã¤r en gruppering av nÃ¥got som ska Ã¶versÃ¤ttas. Du anger en VCS-arkivplats och en filmask fÃ¶r de filer du vill Ã¶versÃ¤tta, och Weblate hÃ¤mtar automatiskt frÃ¥n detta VCS och hittar alla matchande Ã¶versÃ¤ttningsbara filer.

source: You can find some examples of typical configurations in the :ref:`formats`.
sv: Du kan hitta nÃ¥gra exempel pÃ¥ typiska konfigurationer i :ref:`formats`.

source: It is recommended to keep translation components to a reasonable size - split the translation by anything that makes sense in your case (individual apps or add-ons, book chapters or websites).
sv: Det rekommenderas att hÃ¥lla Ã¶versÃ¤ttningskomponenterna till en rimlig storlek â dela upp Ã¶versÃ¤ttningen efter vad som Ã¤r lÃ¤mpligt i ditt fall (enskilda appar eller tillÃ¤gg, bokkapitel eller webbplatser).

source: Weblate easily handles translations with 10000s of strings, but it is harder to split work and coordinate among translators with such large translation components.
sv: Weblate hanterar enkelt Ã¶versÃ¤ttningar med tiotusentals strÃ¤ngar, men det Ã¤r svÃ¥rare att dela upp arbetet och samordna mellan Ã¶versÃ¤ttare med sÃ¥ stora Ã¶versÃ¤ttningskomponenter.

source: Should the language definition for a translation be missing, an empty definition is created and named as "cs_CZ (generated)". You should adjust the definition and report this back to the Weblate authors, so that the missing languages can be included in next release.
sv: Om sprÃ¥kdefinitionen fÃ¶r en Ã¶versÃ¤ttning saknas skapas en tom definition som fÃ¥r namnet "cs_CZ (genererad)". Du bÃ¶r justera definitionen och rapportera detta till Weblate-fÃ¶rfattarna, sÃ¥ att de saknade sprÃ¥ken kan inkluderas i nÃ¤sta version.

source: The component contains all important parameters for working with the VCS, and for getting translations out of it:
sv: Komponenten innehÃ¥ller alla viktiga parametrar fÃ¶r att arbeta med VCS och fÃ¶r att fÃ¥ ut Ã¶versÃ¤ttningar frÃ¥n det:

source: Verbose component name, used to display the component name.
sv: Detaljerat komponentnamn, anvÃ¤nds fÃ¶r att visa komponentnamnet.

source: Component name suitable for URLs.
sv: Komponentnamn som Ã¤r lÃ¤mpligt fÃ¶r URL:er.

source: Component project
sv: Komponentprojekt

source: :ref:`project` where the component belongs.
sv: :ref:`project` dÃ¤r komponenten hÃ¶r hemma.

source: VCS to use, see :ref:`vcs` for details.
sv: VCS att anvÃ¤nda, se :ref:`vcs` fÃ¶r mer information.

source: VCS repository used to pull changes.
sv: VCS-arkiv som anvÃ¤nds fÃ¶r att hÃ¤mta Ã¤ndringar.

source: See :ref:`vcs-repos` for more details on specifying URLs.
sv: Se :ref:`vcs-repos` fÃ¶r mer information om hur du anger URL:er.

source: This can either be a real VCS URL or ``weblate://project/component`` indicating that the repository should be shared with another component. See :ref:`internal-urls` for more details.
sv: Detta kan antingen vara en riktig VCS-URL eller ``weblate://project/component``, vilket indikerar att arkivet ska delas med en annan komponent. Se :ref:`internal-urls` fÃ¶r mer information.

source: Repository URL used for pushing. The behavior of this depends on :ref:`component-vcs`, and this is in more detail covered in :ref:`push-changes`.
sv: Repository-URL som anvÃ¤nds fÃ¶r pushning. Hur detta fungerar beror pÃ¥ :ref:`component-vcs`, vilket beskrivs mer detaljerat i :ref:`push-changes`.

source: For linked repositories, this is not used and setting from linked component applies.
sv: FÃ¶r lÃ¤nkade arkiv anvÃ¤nds detta inte och instÃ¤llningen frÃ¥n den lÃ¤nkade komponenten gÃ¤ller.

source: See :ref:`vcs-repos` for more details on how to specify a repository URL and :ref:`push-changes` for more details on pushing changes from Weblate.
sv: Se :ref:`vcs-repos` fÃ¶r mer information om hur du anger en URL till ett arkiv och :ref:`push-changes` fÃ¶r mer information om hur du Ã¶verfÃ¶r Ã¤ndringar frÃ¥n Weblate.

source: URL of repository browser used to display source files (location of used messages). When empty, no such links will be generated. You can use :ref:`markup`.
sv: URL till arkivblÃ¤ddraren som anvÃ¤nds fÃ¶r att visa kÃ¤llfiler (plats fÃ¶r anvÃ¤nda meddelanden). Om fÃ¤ltet Ã¤r tomt genereras inga sÃ¥dana lÃ¤nkar. Du kan anvÃ¤nda :ref:`markup`.

source: For example on GitHub, use something like: ``https://github.com/WeblateOrg/hello/blob/{{branch}}/{{filename}}#L{{line}}``
sv: PÃ¥ GitHub kan du till exempel anvÃ¤nda nÃ¥got i stil med: ``https://github.com/WeblateOrg/hello/blob/{{branch}}/{{filename}}#L{{line}}``

source: In case your paths are relative to different folder (path contains ``..``), you might want to strip leading directory by ``parentdir`` filter (see :ref:`markup`): ``https://github.com/WeblateOrg/hello/blob/{{branch}}/{{filename|parentdir}}#L{{line}}``
sv: Om dina sÃ¶kvÃ¤gar Ã¤r relativa till olika mappar (sÃ¶kvÃ¤gen innehÃ¥ller ``..``), kanske du vill ta bort den inledande katalogen med filtret ``parentdir`` (se :ref:`markup`): ``https://github.com/WeblateOrg/hello/blob/{{branch}}/{{filename|parentdir}}#L{{line}}``

source: URL where changes made by Weblate are exported. This is important when :ref:`continuous-translation` is not used, or when there is a need to manually merge changes. You can use :ref:`git-exporter` to automate this for Git repositories.
sv: URL dÃ¤r Ã¤ndringar gjorda av Weblate exporteras. Detta Ã¤r viktigt nÃ¤r :ref:`continuous-translation` inte anvÃ¤nds, eller nÃ¤r det finns ett behov av att manuellt sammanfoga Ã¤ndringar. Du kan anvÃ¤nda :ref:`git-exporter` fÃ¶r att automatisera detta fÃ¶r Git-arkiv.

source: Which branch to checkout from the VCS, and where to look for translations.
sv: Vilken gren ska man checka ut frÃ¥n VCS, och var ska man leta efter Ã¶versÃ¤ttningar.

source: Branch for pushing changes, leave empty to use :ref:`component-branch`.
sv: Gren fÃ¶r att driva igenom Ã¤ndringar, lÃ¤mna tomt fÃ¶r att anvÃ¤nda :ref:`component-branch`.

source: This is currently only supported for Git, GitLab and GitHub, it is ignored for other VCS integrations.
sv: Detta stÃ¶ds fÃ¶r nÃ¤rvarande endast fÃ¶r Git, GitLab och GitHub, och ignoreras fÃ¶r andra VCS-integrationer.

source: Mask of files to translate, including path. It should include one "*" replacing language code (see :ref:`languages` for info on how this is processed). In case your repository contains more than one translation file (e.g. more gettext domains), you need to create a component for each of them.
sv: Mask fÃ¶r filer som ska Ã¶versÃ¤ttas, inklusive sÃ¶kvÃ¤g. Den ska innehÃ¥lla ett "*" som ersÃ¤tter sprÃ¥kkoden (se :ref:`languages` fÃ¶r information om hur detta bearbetas). Om ditt arkiv innehÃ¥ller mer Ã¤n en Ã¶versÃ¤ttningsfil (t.ex. fler gettext-domÃ¤ner) mÃ¥ste du skapa en komponent fÃ¶r var och en av dem.

source: For example ``po/*.po`` or ``locale/*/LC_MESSAGES/django.po``.
sv: Till exempel ``po/*.po`` eller ``locale/*/LC_MESSAGES/django.po``.

source: In case your filename contains special characters such as ``[``, ``]``, these need to be escaped as ``[[]`` or ``[]]``.
sv: Om ditt filnamn innehÃ¥ller specialtecken som ``[``, ``]`` mÃ¥ste dessa ersÃ¤ttas med ``[[]`` eller ``[]]``.

source: This feature allows the discovery and updating of screenshots through screenshot file masks, using paths from the VCS repository. This operates at the component level and necessitates the use of an asterisk "*" to replace the screenshot file name.
sv: Denna funktion mÃ¶jliggÃ¶r upptÃ¤ckt och uppdatering av skÃ¤rmdumpar genom skÃ¤rmdumpfilmasker, med hjÃ¤lp av sÃ¶kvÃ¤gar frÃ¥n VCS-arkivet. Detta fungerar pÃ¥ komponentnivÃ¥ och krÃ¤ver att man anvÃ¤nder en asterisk "*" fÃ¶r att ersÃ¤tta skÃ¤rmdumpfilens namn.

source: Allowed formats are WebP, JPEG, PNG, APNG and GIF.
sv: TillÃ¥tna format Ã¤r WebP, JPEG, PNG, APNG och GIF.

source: Note:
sv: Anteckning:

source: The file mask and screenshot file mask are not related. Configure them separately.
sv: Filmasken och skÃ¤rmdumpsfilmasken Ã¤r inte relaterade. Konfigurera dem separat.

source: It is a manual job to link a discovered screenshot in a component to a specific translation key.
sv: Det Ã¤r ett manuellt arbete att lÃ¤nka en upptÃ¤ckt skÃ¤rmdump i en komponent till en specifik Ã¶versÃ¤ttningsnyckel.

source: Let's assume your VCS repository has a structure like this:
sv: LÃ¥t oss anta att ditt VCS-arkiv har en struktur som denna:

source: For component_A, you want to allow discovery and updates of PNG screenshots. You'd set the screenshot file mask for component_A as ``component_A/docs/*.png``. This means any PNG images under docs in component_A can be discovered and updated. So, if you want to update ``image1.png``, the new screenshot you provide should be named ``image1.png``, matching the existing ``filename``, and stored under ``component_A/docs/``.
sv: FÃ¶r komponent_A vill du tillÃ¥ta upptÃ¤ckt och uppdatering av PNG-skÃ¤rmdumpar. Du stÃ¤ller in skÃ¤rmdumpfilmasken fÃ¶r komponent_A som ``component_A/docs/*.png``. Detta innebÃ¤r att alla PNG-bilder under docs i komponent_A kan upptÃ¤ckas och uppdateras. Om du vill uppdatera ``image1.png`` ska den nya skÃ¤rmdumpen du tillhandahÃ¥ller namnges ``image1.png``, sÃ¥ att den matchar det befintliga ``filnamnet``, och lagras under ``component_A/docs/``.

source: Base file containing string definitions for :ref:`monolingual`.
sv: Basfil som innehÃ¥ller strÃ¤ngdefinitioner fÃ¶r :ref:`monolingual`.

source: Whether to allow editing strings in the :ref:`component-template`.
sv: Om redigering av strÃ¤ngar ska tillÃ¥tas i :ref:`component-template`.

source: Intermediate language file for :ref:`monolingual`. In most cases this is a translation file provided by developers and is used when creating actual source strings.
sv: Mellanliggande sprÃ¥kfil fÃ¶r :ref:`monolingual`. I de flesta fall Ã¤r detta en Ã¶versÃ¤ttningsfil som tillhandahÃ¥lls av utvecklare och anvÃ¤nds nÃ¤r man skapar faktiska kÃ¤llstrÃ¤ngar.

source: When set, the source strings are based on this file, but all other languages are based on :ref:`component-template`. In case the string is not translated into the source language, translating to other languages is prohibited. This provides :ref:`source-quality-gateway`.
sv: NÃ¤r detta Ã¤r instÃ¤llt baseras kÃ¤llstrÃ¤ngarna pÃ¥ denna fil, men alla andra sprÃ¥k baseras pÃ¥ :ref:`component-template`. Om strÃ¤ngen inte Ã¤r Ã¶versatt till kÃ¤llsprÃ¥ket Ã¤r det fÃ¶rbjudet att Ã¶versÃ¤tta den till andra sprÃ¥k. Detta ger :ref:`source-quality-gateway`.

source: Base file used to generate new translations.
sv: Basfil som anvÃ¤nds fÃ¶r att generera nya Ã¶versÃ¤ttningar.

source: Keep this field empty for most of the monoligual formats. Those are typically able to start from an empty file.
sv: LÃ¤mna detta fÃ¤lt tomt fÃ¶r de flesta ensprÃ¥kiga format. Dessa kan vanligtvis starta frÃ¥n en tom fil.

source: Choose ``.pot`` file with GNU gettext PO files.
sv: VÃ¤lj ``.pot``-fil med GNU gettext PO-filer.

source: Choose blank file without translations, if you have one.
sv: VÃ¤lj en tom fil utan Ã¶versÃ¤ttningar, om du har en sÃ¥dan.

source: Choose :ref:`component-template` for monolingual formats that need a full set of keys present.
sv: VÃ¤lj :ref:`component-template` fÃ¶r ensprÃ¥kiga format som krÃ¤ver en fullstÃ¤ndig uppsÃ¤ttning nycklar.

source: Choose :ref:`component-template` for document translations.
sv: VÃ¤lj :ref:`component-template` fÃ¶r dokumentÃ¶versÃ¤ttningar.

source: Choose any translation file for others.
sv: VÃ¤lj valfri Ã¶versÃ¤ttningsfil fÃ¶r andra.

source: Template file can be the same as the base file in most cases.
sv: Mallfilen kan i de flesta fall vara densamma som basfilen.

source: In many monolingual formats Weblate starts with empty file by default. Use this in case you want to have all strings present with empty value when creating new translation.
sv: I mÃ¥nga ensprÃ¥kiga format startar Weblate med en tom fil som standard. AnvÃ¤nd detta om du vill att alla strÃ¤ngar ska ha tomma vÃ¤rden nÃ¤r du skapar en ny Ã¶versÃ¤ttning.

source: Translation file format, see also :ref:`formats`.
sv: ÃversÃ¤ttningsfilformat, se Ã¤ven :ref:`formats`.

source: Parameters used to configure how translation files are processed, see also :ref:`file_format_params`.
sv: Parametrar som anvÃ¤nds fÃ¶r att konfigurera hur Ã¶versÃ¤ttningsfiler bearbetas, se Ã¤ven :ref:`file_format_params`.

source: Email address used for reporting upstream bugs. This address will also receive notification about any source string comments made in Weblate.
sv: E-postadress som anvÃ¤nds fÃ¶r att rapportera uppstrÃ¶msfel. Denna adress kommer ocksÃ¥ att fÃ¥ meddelanden om alla kommentarer till kÃ¤llstrÃ¤ngar som gÃ¶rs i Weblate.

source: With the :ref:`gettext` format, this address is also saved by Weblate in the :mailheader:`Report-Msgid-Bugs-To` header of the file.
sv: Med :ref:`gettext`-formatet sparas denna adress ocksÃ¥ av Weblate i :mailheader:`Report-Msgid-Bugs-To`-rubriken i filen.

source: Hides the glossary panel and its matches in the translation editor for this component. When enabled, glossary suggestions for this component are not computed, and the Glossary panel (including its âAdd term to glossaryâ action) is hidden in the editor.
sv: DÃ¶ljer ordlistan och dess trÃ¤ffar i Ã¶versÃ¤ttningsredigeraren fÃ¶r denna komponent. NÃ¤r denna funktion Ã¤r aktiverad berÃ¤knas inga ordlistfÃ¶rslag fÃ¶r denna komponent och ordlistan (inklusive funktionen "LÃ¤gg till term i ordlistan") dÃ¶ljs i redigeraren.

source: Glossary self-references are always excluded from matches even when this option is disabled.
sv: SjÃ¤lvreferenser i ordlistan utesluts alltid frÃ¥n matchningar, Ã¤ven nÃ¤r detta alternativ Ã¤r inaktiverat.

source: You can turn off propagation of translations to this component from other components within same project. This really depends on what you are translating, sometimes it's desirable to have make use of a translation more than once.
sv: Du kan inaktivera Ã¶verfÃ¶ring av Ã¶versÃ¤ttningar till denna komponent frÃ¥n andra komponenter inom samma projekt. Detta beror pÃ¥ vad du Ã¶versÃ¤tter, ibland Ã¤r det Ã¶nskvÃ¤rt att anvÃ¤nda en Ã¶versÃ¤ttning mer Ã¤n en gÃ¥ng.

source: It's usually a good idea to turn this off for monolingual translations, unless you are using the same IDs across the whole project.
sv: Det Ã¤r vanligtvis en bra idÃ© att stÃ¤nga av denna funktion fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar, sÃ¥vida du inte anvÃ¤nder samma ID:n i hela projektet.

source: The default value can be changed by :setting:`DEFAULT_TRANSLATION_PROPAGATION`.
sv: StandardvÃ¤rdet kan Ã¤ndras genom att stÃ¤lla in :setting:`DEFAULT_TRANSLATION_PROPAGATION`.

source: Enable suggestions
sv: Aktivera fÃ¶rslag

source: Whether translation suggestions are accepted for this component.
sv: Om Ã¶versÃ¤ttningsfÃ¶rslag accepteras fÃ¶r denna komponent.

source: Turns on vote casting for suggestions, see :ref:`voting`.
sv: Aktiverar omrÃ¶stning fÃ¶r fÃ¶rslag, se :ref:`voting`.

source: Automatically accept voted suggestions, see :ref:`voting`.
sv: Acceptera automatiskt rÃ¶stade fÃ¶rslag, se :ref:`voting`.

source: License of the translation (does not need to be the same as the source code license).
sv: Licens fÃ¶r Ã¶versÃ¤ttningen (behÃ¶ver inte vara densamma som kÃ¤llkodslicensen).

source: Markdown can be used for text formatting or inserting links.
sv: Markdown kan anvÃ¤ndas fÃ¶r textformatering eller fÃ¶r att infoga lÃ¤nkar.

source: How to handle requests for creation of new languages. Available options:
sv: Hur man hanterar fÃ¶rfrÃ¥gningar om skapande av nya sprÃ¥k. TillgÃ¤ngliga alternativ:

source: User can select desired language and the project maintainers will receive a notification about this. It is up to them to add (or not) the language to the repository.
sv: AnvÃ¤ndaren kan vÃ¤lja Ã¶nskat sprÃ¥k och projektansvariga kommer att fÃ¥ ett meddelande om detta. Det Ã¤r upp till dem att lÃ¤gga till (eller inte) sprÃ¥ket i arkivet.

source: User is presented a link to page which describes process of starting new translations. Use this in case more formal process is desired (for example forming a team of people before starting actual translation).
sv: AnvÃ¤ndaren fÃ¥r en lÃ¤nk till en sida som beskriver processen fÃ¶r att starta nya Ã¶versÃ¤ttningar. AnvÃ¤nd detta om en mer formell process Ã¶nskas (till exempel att bilda ett team innan den faktiska Ã¶versÃ¤ttningen pÃ¥bÃ¶rjas).

source: User can select language and Weblate automatically creates the file for it and translation can begin.
sv: AnvÃ¤ndaren kan vÃ¤lja sprÃ¥k och Weblate skapar automatiskt filen fÃ¶r det sprÃ¥ket, varefter Ã¶versÃ¤ttningen kan pÃ¥bÃ¶rjas.

source: There will be no option for user to start new translation.
sv: Det kommer inte att finnas nÃ¥gon mÃ¶jlighet fÃ¶r anvÃ¤ndaren att starta en ny Ã¶versÃ¤ttning.

source: The project admins can add new translations even if it is disabled here when it is possible (either :ref:`component-new_base` or the file format supports starting from an empty file).
sv: ProjektadministratÃ¶rerna kan lÃ¤gga till nya Ã¶versÃ¤ttningar Ã¤ven om det Ã¤r inaktiverat hÃ¤r nÃ¤r det Ã¤r mÃ¶jligt (antingen :ref:`component-new_base` eller filformatet stÃ¶der att man bÃ¶rjar med en tom fil).

source: Configures whether users in Weblate will be allowed to add new strings and remove existing ones. Adjust this to match your localization workflow - how the new strings are supposed to be introduced.
sv: Konfigurerar om anvÃ¤ndare i Weblate ska fÃ¥ lÃ¤gga till nya strÃ¤ngar och ta bort befintliga. Justera detta sÃ¥ att det passar ditt lokaliseringsarbetsflÃ¶de â hur de nya strÃ¤ngarna ska introduceras.

source: For bilingual formats, the strings are typically extracted from the source code (for example by using :program:`xgettext`) and adding new strings in Weblate should be disabled (they would be discarded next time you update the translation files). In Weblate you can manage strings for every translation and it does not enforce the strings in all translations to be consistent.
sv: FÃ¶r tvÃ¥sprÃ¥kiga format extraheras strÃ¤ngarna vanligtvis frÃ¥n kÃ¤llkoden (till exempel med hjÃ¤lp av :program:`xgettext`) och det bÃ¶r vara omÃ¶jligt att lÃ¤gga till nya strÃ¤ngar i Weblate (de skulle tas bort nÃ¤sta gÃ¥ng du uppdaterar Ã¶versÃ¤ttningsfilerna). I Weblate kan du hantera strÃ¤ngar fÃ¶r varje Ã¶versÃ¤ttning och det krÃ¤ver inte att strÃ¤ngarna i alla Ã¶versÃ¤ttningar Ã¤r konsekventa.

source: For monolingual formats, the strings are managed only on source language and are automatically added or removed in the translations. The strings appear in the translation files once they are translated.
sv: FÃ¶r ensprÃ¥kiga format hanteras strÃ¤ngarna endast pÃ¥ kÃ¤llsprÃ¥ket och lÃ¤ggs automatiskt till eller tas bort i Ã¶versÃ¤ttningarna. StrÃ¤ngarna visas i Ã¶versÃ¤ttningsfilerna nÃ¤r de har Ã¶versatts.

source: You might want to turn on :ref:`component-edit_template` together with :guilabel:`Manage strings` for monolingual formats.
sv: Du kanske vill aktivera :ref:`component-edit_template` tillsammans med :guilabel:`Hantera strÃ¤ngar` fÃ¶r ensprÃ¥kiga format.

source: Weblate recognizes any of the language codes when parsing translation files, following settings only influences how new files are created.
sv: Weblate kÃ¤nner igen alla sprÃ¥kkoder nÃ¤r Ã¶versÃ¤ttningsfiler analyseras. InstÃ¤llningarna pÃ¥verkar endast hur nya filer skapas.

source: Dependent on file format, for most of them POSIX is used.
sv: Beroende pÃ¥ filformat anvÃ¤nds POSIX fÃ¶r de flesta av dem.

source: Typically used by gettext and related tools, produces language codes like ``pt_BR``.
sv: AnvÃ¤nds vanligtvis av gettext och relaterade verktyg, genererar sprÃ¥kkoder som ``pt_BR``.

source: POSIX style language code including the country code even when not necessary (for example ``cs_CZ``).
sv: POSIX-stil sprÃ¥kkod inklusive landskod Ã¤ven nÃ¤r det inte Ã¤r nÃ¶dvÃ¤ndigt (till exempel ``cs_CZ``).

source: POSIX style language code including the country code even when not necessary (lowercase) (for example ``cs_cz``).
sv: POSIX-stil sprÃ¥kkod inklusive landskod Ã¤ven nÃ¤r det inte Ã¤r nÃ¶dvÃ¤ndigt (smÃ¥ bokstÃ¤ver) (till exempel ``cs_cz``).

source: Typically used on web platforms, produces language codes like ``pt-BR``.
sv: AnvÃ¤nds vanligtvis pÃ¥ webbplattformar och genererar sprÃ¥kkoder som ``pt-BR``.

source: BCP style language code including the country code even when not necessary (for example ``cs-CZ``).
sv: BCP-sprÃ¥kkod inklusive landskod Ã¤ven nÃ¤r det inte Ã¤r nÃ¶dvÃ¤ndigt (till exempel ``cs-CZ``).

source: Uses legacy codes for Chinese and BCP style notation.
sv: AnvÃ¤nder Ã¤ldre koder fÃ¶r kinesiska och BCP-stilnotation.

source: BCP style notation, all in lower case (for example ``cs-cz``).
sv: BCP-stilnotation, helt i gemener (till exempel ``cs-cz``).

source: Style suitable for uploading metadata to Apple App Store.
sv: Stil som Ã¤r lÃ¤mplig fÃ¶r uppladdning av metadata till Apple App Store.

source: Style suitable for uploading metadata to Google Play Store.
sv: Stil som Ã¤r lÃ¤mplig fÃ¶r uppladdning av metadata till Google Play Store.

source: Only used in Android apps, produces language codes like ``pt-rBR``.
sv: AnvÃ¤nds endast i Android-appar, genererar sprÃ¥kkoder som ``pt-rBR``.
